/*
 * Copyright (C) 2008 Stefan Bienert
 *
 * This file is part of CoRB.
 *
 * CoRB is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * CoRB is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with CoRB.  If not, see <http://www.gnu.org/licenses/>.
 */


/*
 ****   Documentation header   ***
 *
 *  @file libcrbrna/nn_scores.c
 *
 *  @brief Neares neighbour Model for evaluating RNA secondary structures
 *
 *  Module: nn_scores
 *
 *  Library: crbrna
 *
 *  Project: CoRB - Collection of RNAanalysis Binaries
 *
 *  @author Stefan Bienert
 *
 *  @date 2008-07-03
 *
 *
 *  Revision History:
 *         - 2008Jul03 bienert: created
 *
 *  ToDo:
 *         - change scheme->bp_idx_size to be non quadratic
 *           (get rid of sqrt testing, calc. quadratic size on demand)
 *         - functions: all seq. related input in 5' to 3' order,e.g.get_G_int12
 */


#include <config.h>
#include <math.h>
#include <stdlib.h>
#include <stdarg.h>
#include <libcrbbasic/crbbasic.h>
/*#include "alphabet.h"*/
#include "nn_scores.h"

#define NO_ALLOWED_BP 6         /* no. of canonical base pairs + whobble GU */
#define D_MM_H 3                /* dimensions of the G_mismatch_hairpin table */
#define D_MM_I 3                /* dim. of the G_mismatch_interior table */
#define D_INT11 4               /* dimensionality of G_int11 table */
#define D_INT21 5               /* dimensionality of G_int21 table */
#define D_INT22 6               /* dimensionality of G_int22 table */
#define D_TL   6                /* size of a tetraloop + closing bp */
#define NN_LXC37 107.856f       /* ask marco about this */
#define NN_ML_OFFSET 340
#define NN_ML_UNPAIRED 0
#define NN_ML_STEMS 40
#define NN_NINIO_M 50
#define NN_NINIO_MAX 300

struct NN_scores {
      /*c*/float** G_stack;                         /* stacking energies */
      unsigned long G_stack_size;
      /*c*/float** G_mm_stack;                   /* stacks with one mismatch */
      unsigned long G_mm_stack_size;
      /*c*/float* G_hairpin_loop;                   /* hairpin loops */
      unsigned long G_hairpin_loop_size;
      /*c*/float*** G_mismatch_hairpin;        /* hairpin loop closing bp */
      unsigned long G_mismatch_hairpin_size;
      /*c*/float* non_gc_penalty_for_bp;      /* penalty for closing non-GC */
      char** tetra_loop;               /* sorted list of possible loops */
      /*c*/float* G_tetra_loop;                     /* scores */
      unsigned long tetra_loop_size;
      /*c*/float* G_bulge_loop;                     /* bulge loops */
      unsigned long G_bulge_loop_size;
      /* internal loops */
      /*c*/float* G_internal_loop;                  /* generic loops */
      unsigned long G_internal_loop_size;
      /*c*/float**** G_int11;                       /* 1x1 loops */
      unsigned long G_int11_size;
      /*c*/float***** G_int21;                      /* 2x1 loops */
      unsigned long G_int21_size;
      /*c*/float****** G_int22;                      /* 2x2 loops */
      unsigned long G_int22_size;
      /*c*/float*** G_mismatch_interior;         /* interior loop closing bp */
      unsigned long G_mismatch_interior_size;
      /* internal loops */
      /*c*/float** G_dangle5;                  /* 5' dangling end, bp + base */
      unsigned long G_dangle5_size;
      /*c*/float** G_dangle3;                 /* 3' dangling end, bp + base */
      unsigned long G_dangle3_size;
      char** bp_allowed;                     /* WC base pairs + whobble GU */
      unsigned long bp_allowed_size;
      char** bp_idx;                     /* indeces for base pairs */
      unsigned long bp_idx_size;
};


/**********************   Constructors and destructors   **********************/

/** @brief Create a new Nearest Neighbour scoring scheme.
 *
 * The constructor for @c NN_scores objects. If compiled with enabled
 * memory checking, @c file and @c line should point to the position where the
 * function was called. Both parameters are automatically set by using the
 * macro @c NN_SCORES_NEW.\n
 * Returns @c NULL on error.
 *
 * @param[in] file fill with name of calling file.
 * @param[in] line fill with calling line.
 */
NN_scores*
nn_scores_new (const char* file, const int line)
{
   /* allocate 1 object */
